# EndPoly

## Description
Procedure EndPoly completes the definition of a polygon or polyline object within a VectorWorks document. On calling EndPoly, the object is created in the document from the preceding vertex creation calls.

```pascal
PROCEDURE EndPoly;
```

```python
def vs.EndPoly():
    return None
```

## Examples
```pascal
EndPoly;
```
```python
vs.ArcTo( 	0,1 * dMmarkerSize, 0 )
vs.LineTo( 	0.5 * dMmarkerSize, 0.5 * dMmarkerSize )
vs.LineTo( 	0,1 * dMmarkerSize )
vs.EndPoly()
vs.MoveTo ( 0,1.5 	* dMmarkerSize )

vs.AddPoint( p5 )
vs.AddPoint( p6 )
vs.AddPoint( p70 )
vs.EndPoly()

vs.AddPoint( p3 )
vs.AddPoint( p6 )
vs.AddPoint( p5 )
vs.EndPoly()
SetAttrsByClassOrParent(vs.LNewObj(), gObjHandle, gPaving_Class, vs.PShow_Joints)
```
See also in tutorials: 03. Build a Curved Path with Mixed Vertex Types, 04. Extrude 2D Shapes into 3D Solids, 12. Polygon Area and Centroid (Shoelace Formula), 13. Point-in-Polygon Test (Ray Casting)

## See Also
<listTable indent="1" cols="4">
AddPoint
ArcTo
BeginPoly
ClosePoly
CurveThrough
CurveTo
DelVertex
EndPoly
GetHole
GetNumHoles
GetPolylineVertex
GetPolyPt
GetVertexVisibility
GetVertNum
InsertVertex
OpenPoly
Poly
SetPolylineVertex
SetPolyPt
SetVertexVisibility
Smooth
</listTable>

## Version
Availability: from All Versions

## Category
* Objects - Polys